<!-- 
не-ми-се-правят-домашни = A    няма-да-ги-направя= B  
ще-ги-направя-частично= !B    ще-се-скатая=C
няма-да-се-скатавам=!C     

A && B || !B && C || !C && B   =>      !B && C || !C && B = B xor C

    optimization
A && B || B xor C



A      B      C     A && B    !B && C    !C && B  
0      0      0       0          0          0
1      0      0       0          0          0
1      1      0       1          0          1
0      1      1       0          0          0
0      0      1       0          1          0
1      1      1       1          0          0

 -->